jamelofs/CoreN2G/src/STM32/HardwareTimer.cpp
/*
  Copyright (c) 2017 Daniel Fekete

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in all
  copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
  SOFTWARE.

  Copyright (c) 2019 STMicroelectronics
  Modified to support Arduino_Core_STM32
*/

#include <CoreImp.h>
#include "HardwareTimer.h"

#ifdef HAL_TIM_MODULE_ENABLED

/* Private Defines */
#define PIN_NOT_USED 0xFF
#define MAX_RELOAD ((1 << 16) - 1) // Currently even 32b timers are used as 16b to have generic behavior

/* Private Variables */
HardwareTimerObj_t *HardwareTimer_Handle[TIMER_NUM] = {NULL};

IRQn_Type getTimerUpIrq(TIM_TypeDef *tim);
IRQn_Type getTimerCCIrq(TIM_TypeDef *tim);

static uint32_t get_pwm_channel(PinName pin)
{
  uint32_t function = pinmap_function(pin, PinMap_PWM);
  uint32_t channel = 0;
  switch (STM_PIN_CHANNEL(function)) {
    case 1:
      channel = TIM_CHANNEL_1;
      break;
    case 2:
      channel = TIM_CHANNEL_2;
      break;
    case 3:
      channel = TIM_CHANNEL_3;
      break;
    case 4:
      channel = TIM_CHANNEL_4;
      break;
    default:
      channel = 0;
      break;
  }
  return channel;
}
/**
  * @brief  HardwareTimer constructor: set default configuration values
  * @param  Timer instance ex: TIM1, ...
  * @retval None
  */
HardwareTimer::HardwareTimer(TIM_TypeDef *instance)
{
  uint32_t index = get_timer_index(instance);
  if (index == UNKNOWN_TIMER) {
    Error_Handler();
  }

  HardwareTimer_Handle[index] = &_HardwareTimerObj;

  _HardwareTimerObj.handle.Instance = instance;
  _HardwareTimerObj.handle.Channel = HAL_TIM_ACTIVE_CHANNEL_CLEARED;
  _HardwareTimerObj.handle.hdma[0] = NULL;
  _HardwareTimerObj.handle.hdma[1] = NULL;
  _HardwareTimerObj.handle.hdma[2] = NULL;
  _HardwareTimerObj.handle.hdma[3] = NULL;
  _HardwareTimerObj.handle.hdma[4] = NULL;
  _HardwareTimerObj.handle.hdma[5] = NULL;
  _HardwareTimerObj.handle.hdma[6] = NULL;
  _HardwareTimerObj.handle.Lock = HAL_UNLOCKED;
  _HardwareTimerObj.handle.State = HAL_TIM_STATE_RESET;

  _HardwareTimerObj.handle.Instance = instance;
  _HardwareTimerObj.__this = (void *)this;

  // Enable Timer clock
  enableTimerClock(&(_HardwareTimerObj.handle));

  // Configure HAL structure for all channels
  for (int i = 0; i < TIMER_CHANNELS; i++) {
    _channelOC[i].OCMode = TIMER_NOT_USED;
    _channelOC[i].OCPolarity = TIM_OCPOLARITY_HIGH;
    _channelOC[i].OCFastMode = TIM_OCFAST_DISABLE;

#if defined(TIM_CR2_OIS1)
    _channelOC[i].OCIdleState = TIM_OCIDLESTATE_RESET;
#endif
#if defined(TIM_CCER_CC1NE)
    _channelOC[i].OCNPolarity = TIM_OCNPOLARITY_HIGH;
#if defined(TIM_CR2_OIS1)
    _channelOC[i].OCNIdleState = TIM_OCNIDLESTATE_RESET;
#endif
#endif
    _channelIC[i].ICPolarity = TIMER_NOT_USED;
    _channelIC[i].ICSelection = TIM_ICSELECTION_DIRECTTI;
    _channelIC[i].ICPrescaler = TIM_ICPSC_DIV1;
    _channelIC[i].ICFilter = 0;

    for (int i = 0; i < TIMER_CHANNELS + 1 ; i++) {
      callbacks[i] = NULL;
    }
  }
}

/**
  * @brief  Pause HardwareTimer: stop timer
  * @param  None
  * @retval None
  */
void HardwareTimer::pause()
{
  HAL_TIM_Base_Stop_IT(&(_HardwareTimerObj.handle));
}

/**
  * @brief  Start or resume HardwareTimer: all channels are resumed, interrupts are enabled if necessary
  * @param  None
  * @retval None
  */
void HardwareTimer::resume(void)
{
  _HardwareTimerObj.handle.Init.CounterMode = TIM_COUNTERMODE_UP;
  _HardwareTimerObj.handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
#if defined(TIM_RCR_REP)
  _HardwareTimerObj.handle.Init.RepetitionCounter = 0;
#endif
  _HardwareTimerObj.handle.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  HAL_TIM_Base_Init(&(_HardwareTimerObj.handle));

  // Start timer with IT if required
  if (callbacks[0] != NULL) {
    HAL_TIM_Base_Start_IT(&(_HardwareTimerObj.handle));
  } else {
    HAL_TIM_Base_Start(&(_HardwareTimerObj.handle));
  }

  resumeChannel(1);
  resumeChannel(2);
  resumeChannel(3);
  resumeChannel(4);
}

/**
  * @brief  Convert arduino  into HAL channel
  * @param  Arduino channel [1..4]
  * @retval HAL channel. return -1 if arduino channel is invalid
  */
int HardwareTimer::getChannel(uint32_t channel)
{
  uint32_t return_value;

  switch (channel) {
    case 1:
      return_value = TIM_CHANNEL_1;
      break;
    case 2:
      return_value = TIM_CHANNEL_2;
      break;
    case 3:
      return_value = TIM_CHANNEL_3;
      break;
    case 4:
      return_value = TIM_CHANNEL_4;
      break;
    default:
      return_value = -1;
  }
  return return_value;
}

/**
  * @brief  Configure specified channel and resume/start timer
  * @param  Arduino channel [1..4]
  * @retval None
  */
void HardwareTimer::resumeChannel(uint32_t channel)
{
  int timChannel = getChannel(channel);
  if (timChannel == -1) {
    Error_Handler();
  }

  if (IS_TIM_PWM_MODE(_channelOC[channel - 1].OCMode)) {
    HAL_TIM_PWM_ConfigChannel(&(_HardwareTimerObj.handle), &_channelOC[channel - 1], timChannel);

    if ((channel < (TIMER_CHANNELS + 1)) && (callbacks[channel] != NULL)) {
      // Only channel 1..4 can have interruption
#if defined(TIM_CCER_CC1NE)
      if (isComplementaryChannel[channel-1]) {
        HAL_TIMEx_PWMN_Start_IT(&(_HardwareTimerObj.handle), timChannel);
      } else
#endif
      {
        HAL_TIM_PWM_Start_IT(&(_HardwareTimerObj.handle), timChannel);
      }
    } else {
#if defined(TIM_CCER_CC1NE)
      if (isComplementaryChannel[channel-1]) {
        HAL_TIMEx_PWMN_Start(&(_HardwareTimerObj.handle), timChannel);
      } else
#endif
      {
        HAL_TIM_PWM_Start(&(_HardwareTimerObj.handle), timChannel);
      }
    }
  } else if (IS_TIM_OC_MODE(_channelOC[channel - 1].OCMode)) {
    HAL_TIM_OC_ConfigChannel(&(_HardwareTimerObj.handle), &_channelOC[channel - 1], timChannel);

    if ((channel < (TIMER_CHANNELS + 1)) && (callbacks[channel] != NULL)) {
      // Only channel 1..4 can have interruption
#if defined(TIM_CCER_CC1NE)
      if (isComplementaryChannel[channel-1]) {
        HAL_TIMEx_OCN_Start_IT(&(_HardwareTimerObj.handle), timChannel);
      } else
#endif
      {
        HAL_TIM_OC_Start_IT(&(_HardwareTimerObj.handle), timChannel);
      }
    } else {
#if defined(TIM_CCER_CC1NE)
      if (isComplementaryChannel[channel-1]) {
        HAL_TIMEx_OCN_Start(&(_HardwareTimerObj.handle), timChannel);
      } else
#endif
      {
        HAL_TIM_OC_Start(&(_HardwareTimerObj.handle), timChannel);
      }
    }
  } else if (_channelIC[channel - 1].ICPolarity != TIMER_NOT_USED) {
    HAL_TIM_IC_ConfigChannel(&(_HardwareTimerObj.handle), &_channelIC[channel - 1], timChannel);

    if (callbacks[channel] != NULL) {
      HAL_TIM_IC_Start_IT(&(_HardwareTimerObj.handle), timChannel);
    } else {
      HAL_TIM_IC_Start(&(_HardwareTimerObj.handle), timChannel);
    }
  }
}

/**
  * @brief  Retrieve prescaler from hardware register
  * @param  None
  * @retval prescaler factor
  */
uint32_t HardwareTimer::getPrescaleFactor()
{
  // Hardware register correspond to prescaler-1. Example PSC register value 0 means divided by 1
  return (_HardwareTimerObj.handle.Init.Prescaler + 1);
}

/**
  * @brief  Configure hardwareTimer prescaler
  * @param  prescaler factor
  * @retval None
  */
void HardwareTimer::setPrescaleFactor(uint32_t prescaler)
{
  // Hardware register correspond to prescaler-1. Example PSC register value 0 means divided by 1
  __HAL_TIM_SET_PRESCALER(&_HardwareTimerObj.handle, prescaler - 1);
  _HardwareTimerObj.handle.Init.Prescaler = prescaler - 1;
}

/**
  * @brief  Retrieve overflow (rollover) value from hardware register
  * @param  format of returned value. If ommited default format is Tick
  * @retval overflow depending on format value:
  *           TICK_FORMAT:     return number of tick for overflow
  *           MICROSEC_FORMAT: return number of microsecondes for overflow
  *           HERTZ_FORMAT:    return frequency in hertz for overflow
  */
uint32_t HardwareTimer::getOverflow(TimerFormat_t format)
{
  // Hardware register correspond to period count-1. Example ARR register value 9 means period of 10 timer cycle
  uint32_t ARR_RegisterValue = __HAL_TIM_GET_AUTORELOAD(&(_HardwareTimerObj.handle));
  uint32_t Prescalerfactor = _HardwareTimerObj.handle.Instance->PSC + 1;
  uint32_t return_value;
  switch (format) {
    case MICROSEC_FORMAT:
      return_value = (uint32_t)(((ARR_RegisterValue + 1) * Prescalerfactor * 1000000.0) / getTimerClkFreq());
      break;
    case HERTZ_FORMAT:
      return_value = (uint32_t)(getTimerClkFreq() / ((ARR_RegisterValue + 1) * Prescalerfactor));
      break;
    case TICK_FORMAT:
    default :
      return_value = ARR_RegisterValue + 1;
      break;
  }
  return return_value;
}

/**
  * @brief  Set overflow (rollover)
  * @param  overflow: depend on format parameter
  * @param  format of overflow parameter. If ommited default format is Tick
  *           TICK_FORMAT:     overflow is the number of tick for overflow
  *           MICROSEC_FORMAT: overflow is the number of microsecondes for overflow
  *           HERTZ_FORMAT:    overflow is the frequency in hertz for overflow
  * @retval None
  */
void HardwareTimer::setOverflow(uint32_t overflow, TimerFormat_t format)
{
  uint32_t ARR_RegisterValue;
  uint32_t Prescalerfactor;
  uint32_t period_cyc;
  // Remark: Hardware register correspond to period count-1. Example ARR register value 9 means period of 10 timer cycle
  switch (format) {
    case MICROSEC_FORMAT:
      period_cyc = overflow * (getTimerClkFreq() / 1000000);
      Prescalerfactor = (period_cyc / 0x10000) + 1;
      __HAL_TIM_SET_PRESCALER(&_HardwareTimerObj.handle, Prescalerfactor - 1);
      _HardwareTimerObj.handle.Init.Prescaler = Prescalerfactor - 1;
      ARR_RegisterValue = (period_cyc / Prescalerfactor) - 1;
      break;
    case HERTZ_FORMAT:
      period_cyc = getTimerClkFreq() / overflow;
      Prescalerfactor = (period_cyc / 0x10000) + 1;
      __HAL_TIM_SET_PRESCALER(&_HardwareTimerObj.handle, Prescalerfactor - 1);
      _HardwareTimerObj.handle.Init.Prescaler = Prescalerfactor - 1;
      ARR_RegisterValue = (period_cyc / Prescalerfactor) - 1;
      break;
    case TICK_FORMAT:
    default :
      ARR_RegisterValue = overflow - 1;
      break;
  }

