jamelofs/CoreN2G/src/STM32/HardwareTimer.cpp
  __HAL_TIM_SET_AUTORELOAD(&_HardwareTimerObj.handle, ARR_RegisterValue);
  _HardwareTimerObj.handle.Init.Period = ARR_RegisterValue;
}

/**
  * @brief  Retreive timer counter value
  * @param  format of returned value. If ommited default format is Tick
  * @retval overflow depending on format value:
  *           TICK_FORMAT:     return number of tick for counter
  *           MICROSEC_FORMAT: return number of microsecondes for counter
  *           HERTZ_FORMAT:    return frequency in hertz for counter
  */
uint32_t HardwareTimer::getCount(TimerFormat_t format)
{
  uint32_t CNT_RegisterValue = __HAL_TIM_GET_COUNTER(&(_HardwareTimerObj.handle));
  uint32_t Prescalerfactor = _HardwareTimerObj.handle.Instance->PSC + 1;
  uint32_t return_value;
  switch (format) {
    case MICROSEC_FORMAT:
      return_value = (uint32_t)((CNT_RegisterValue * Prescalerfactor * 1000000.0) / getTimerClkFreq());
      break;
    case HERTZ_FORMAT:
      return_value = (uint32_t)(getTimerClkFreq() / (CNT_RegisterValue  * Prescalerfactor));
      break;
    case TICK_FORMAT:
    default :
      return_value = CNT_RegisterValue;
      break;
  }
  return return_value;
}

/**
  * @brief  Set timer counter value
  * @param  counter: depend on format parameter
  * @param  format of overflow parameter. If ommited default format is Tick
  *           TICK_FORMAT:     counter is the number of tick
  *           MICROSEC_FORMAT: counter is the number of microsecondes
  *           HERTZ_FORMAT:    counter is the frequency in hertz
  * @retval None
  */
void HardwareTimer::setCount(uint32_t counter, TimerFormat_t format)
{
  uint32_t CNT_RegisterValue;
  uint32_t Prescalerfactor = _HardwareTimerObj.handle.Instance->PSC + 1;
  switch (format) {
    case MICROSEC_FORMAT:
      CNT_RegisterValue = ((counter * (getTimerClkFreq() / 1000000)) / Prescalerfactor) - 1 ;
      break;
    case HERTZ_FORMAT:
      CNT_RegisterValue = (uint32_t)((getTimerClkFreq() / (counter * Prescalerfactor)) - 1);
      break;
    case TICK_FORMAT:
    default :
      CNT_RegisterValue = counter - 1;
      break;
  }
  __HAL_TIM_SET_COUNTER(&(_HardwareTimerObj.handle), CNT_RegisterValue);
}

/**
  * @brief  Set channel mode
  * @param  channel: Arduino channel [1..4]
  * @param  mode: mode configuration for the channel (see TimerModes_t)
  * @param  pin: Arduino pin number, ex: D1, 1 or PA1
  * @retval None
  */
void HardwareTimer::setMode(uint32_t channel, TimerModes_t mode, uint32_t pin)
{
  setMode(channel, mode, (PinName)pin);
}

/**
  * @brief  Set channel mode
  * @param  channel: Arduino channel [1..4]
  * @param  mode: mode configuration for the channel (see TimerModes_t)
  * @param  pin: pin name, ex: PB_0
  * @retval None
  */
void HardwareTimer::setMode(uint32_t channel, TimerModes_t mode, PinName pin)
{
  if (getChannel(channel) == -1) {
    Error_Handler();
  }

  switch (mode) {
    case TIMER_OUTPUT_COMPARE:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_TIMING;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_OUTPUT_COMPARE_ACTIVE:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_ACTIVE;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_OUTPUT_COMPARE_INACTIVE:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_ACTIVE;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_OUTPUT_COMPARE_TOGGLE:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_TOGGLE;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_OUTPUT_COMPARE_PWM1:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_PWM1;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_OUTPUT_COMPARE_PWM2:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_PWM2;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_OUTPUT_COMPARE_FORCED_ACTIVE:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_FORCED_ACTIVE;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_OUTPUT_COMPARE_FORCED_INACTIVE:
      _channelOC[channel - 1].OCMode = TIM_OCMODE_FORCED_INACTIVE;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    case TIMER_INPUT_CAPTURE_RISING:
      _channelIC[channel - 1].ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
      _channelIC[0].ICSelection = TIM_ICSELECTION_DIRECTTI;
      _channelOC[channel - 1].OCMode = TIMER_NOT_USED;
      break;
    case TIMER_INPUT_CAPTURE_FALLING:
      _channelIC[channel - 1].ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
      _channelIC[0].ICSelection = TIM_ICSELECTION_DIRECTTI;
      _channelOC[channel - 1].OCMode = TIMER_NOT_USED;
      break;
    case TIMER_INPUT_CAPTURE_BOTHEDGE:
      _channelIC[channel - 1].ICPolarity = TIM_INPUTCHANNELPOLARITY_BOTHEDGE;
      _channelOC[channel - 1].OCMode = TIMER_NOT_USED;
      break;
    case TIMER_INPUT_FREQ_DUTY_MEASUREMENT:
      switch (channel) {
        case 1:
          _channelIC[0].ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
          _channelIC[0].ICSelection = TIM_ICSELECTION_DIRECTTI;
          _channelIC[1].ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
          _channelIC[1].ICSelection = TIM_ICSELECTION_INDIRECTTI;
          break;
        case 2:
          _channelIC[1].ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
          _channelIC[1].ICSelection = TIM_ICSELECTION_DIRECTTI;
          _channelIC[0].ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
          _channelIC[0].ICSelection = TIM_ICSELECTION_INDIRECTTI;
          break;
        case 3:
          _channelIC[2].ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
          _channelIC[2].ICSelection = TIM_ICSELECTION_DIRECTTI;
          _channelIC[3].ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
          _channelIC[3].ICSelection = TIM_ICSELECTION_INDIRECTTI;
          break;
        case 4:
          _channelIC[3].ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
          _channelIC[3].ICSelection = TIM_ICSELECTION_DIRECTTI;
          _channelIC[2].ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
          _channelIC[2].ICSelection = TIM_ICSELECTION_INDIRECTTI;
          break;
        default:
          break;
      }
      _channelOC[channel - 1].OCMode = TIMER_NOT_USED;
      break;
    case TIMER_DISABLED:
      _channelOC[channel - 1].OCMode = TIMER_NOT_USED;
      _channelIC[channel - 1].ICSelection = TIM_ICSELECTION_DIRECTTI;
      _channelIC[channel - 1].ICPolarity = TIMER_NOT_USED;
      break;
    default:
      break;
  }

  if (pin != NC) {
    if ((int)get_pwm_channel(pin) == getChannel(channel)) {
      /* Configure PWM GPIO pins */
      pinmap_pinout(pin, PinMap_PWM);
    } else {
      // Pin doesn't match with timer output channels
      Error_Handler();
    }

